# AngularDimensionsForHooksEnabled Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BendingDetailCustomFieldProperties..::..AngularDimensionsForHooksEnabled Property
BendingDetailCustomFieldProperties Class See Also
---
Identifies if the angular dimensions which has a reference set on a hook will be shown or not.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public bool AngularDimensionsForHooksEnabled { get; set; }
```

Visual Basic
---
```text
Public Property AngularDimensionsForHooksEnabled As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool AngularDimensionsForHooksEnabled {
	bool get ();
	void set (bool value);
}
```

# See Also
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace